<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-prod]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-prod]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-prod]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-prod]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-prod]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-prod]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459900000002]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-prod-20231206165907459800000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907477100000003]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-prod-20231206165907497100000004]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-prod]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-prod]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=r242yimvi1]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=a0zpgqqrs2]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=5fakqp]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=kttj2y]
module.api_app.aws_api_gateway_method.opt_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-OPTIONS]
module.api_app.aws_api_gateway_method.get_daily_coffee: Refreshing state... [id=agm-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_method_response.opt_daily_coffee: Refreshing state... [id=agmr-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_api_gateway_integration.opt_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-OPTIONS]
module.api_app.aws_api_gateway_integration.get_daily_coffee: Refreshing state... [id=agi-a0zpgqqrs2-kttj2y-GET]
module.api_app.aws_api_gateway_integration_response.opt_daily_coffee: Refreshing state... [id=agir-a0zpgqqrs2-kttj2y-OPTIONS-200]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=lgsiuc]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-a0zpgqqrs2-prod]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=n2tyx8]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=r242yimvi1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api_app.aws_api_gateway_integration.get_daily_coffee has changed
  ~ resource "aws_api_gateway_integration" "get_daily_coffee" {
      + cache_key_parameters    = []
        id                      = "agi-a0zpgqqrs2-kttj2y-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_integration.opt_daily_coffee has changed
  ~ resource "aws_api_gateway_integration" "opt_daily_coffee" {
      + cache_key_parameters = []
        id                   = "agi-a0zpgqqrs2-kttj2y-OPTIONS"
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_method.get_daily_coffee has changed
  ~ resource "aws_api_gateway_method" "get_daily_coffee" {
      + authorization_scopes = []
        id                   = "agm-a0zpgqqrs2-kttj2y-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }

  # module.api_app.aws_api_gateway_method.opt_daily_coffee has changed
  ~ resource "aws_api_gateway_method" "opt_daily_coffee" {
      + authorization_scopes = []
        id                   = "agm-a0zpgqqrs2-kttj2y-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2023-12-06T16:59:32Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-2:057149530255:a0zpgqqrs2/" -> (known after apply)
      ~ id            = "lgsiuc" -> (known after apply)
      ~ invoke_url    = "https://a0zpgqqrs2.execute-api.eu-south-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "a28abfbc14bfe79f20cebc464bff8c0afd92bd1a" -> "5630f4da56084adb3d01182cb2c418ed31488e3c"
        }
        # (1 unchanged attribute hidden)
    }

  # module.api_app.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "lgsiuc" -> (known after apply)
        id                    = "ags-a0zpgqqrs2-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.s3_hosting.aws_cloudfront_distribution.this will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = "coffee-run-web-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "coffee-run-web.s3-website-eu-south-2.amazonaws.com"
          + origin_id           = "coffee-run-web-origin"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.s3_hosting.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "coffee-run-web"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_hosting.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_hosting.aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`